In [22]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [27]:
conn = create_engine("postgres://qsftbpcq:u6W3A32c1P8rgcw-5iuU263Rd33U3t2t@tuffi.db.elephantsql.com:5432/qsftbpcq")

In [20]:
type(conn)

sqlalchemy.engine.base.Engine

In [11]:
country_codes = pd.read_sql_query("select * from country_codes", conn)
country_codes

                   country_name alpha_2 alpha_3
0                      Zimbabwe      ZW     ZWE
1                        Zambia      ZM     ZMB
2                  South Africa      ZA     ZAF
3                       Mayotte      YT     MYT
4                         Yemen      YE     YEM
..                          ...     ...     ...
244                    Anguilla      AI     AIA
245         Antigua and Barbuda      AG     ATG
246                 Afghanistan      AF     AFG
247  United Arab Emirates (the)      AE     ARE
248                     Andorra      AD     AND

[249 rows x 3 columns]

In [35]:
def run_query(query, conn, year):
    return pd.read_sql_query(query.format(year), conn)

# Países que mais investem em saúde per capita

In [19]:
query = f"""
select h.country_code, c.country_name, c.alpha_2, h.health_expenditure_per_capita
from health_2017 as h
inner join country_codes as c on c.alpha_3 = h.country_code
where h.health_expenditure_per_capita is not null
order by h.health_expenditure_per_capita desc
"""

health_expenditure_per_capita = pd.read_sql_query(query, conn)
health_expenditure_per_capita

,country_code,country_name,alpha_2,health_expenditure_per_capita
0,USA,United States of America (the),US,10246.138672
1,CHE,Switzerland,CH,9956.259766
2,NOR,Norway,NO,7936.375000
3,ISL,Iceland,IS,6086.311523
4,SWE,Sweden,SE,5904.583984
...,...,...,...,...
180,BDI,Burundi,BI,23.500433
181,GMB,Gambia (the),GM,23.272326
182,SSD,South Sudan,SS,22.888573
183,MOZ,Mozambique,MZ,21.071156
184,COD,Congo (the Democratic Republic of the),CD,19.431646

# Queries Relacionadas a saúde

In [47]:
health_expenditure_per_capita_query = """
select
country_name,
country_code,
cc.alpha_2,
health_expenditure_per_capita
from health_{} as h
inner join
country_codes as cc on cc.alpha_3 = h.country_code
where health_expenditure_per_capita is not null
order by health_expenditure_per_capita desc
"""  

nurses_query = """
select
country_name,
country_code,
cc.alpha_2,
nurses_and_midwives
from health_{} as h
inner join
country_codes as cc on cc.alpha_3 = h.country_code
where nurses_and_midwives is not null
order by nurses_and_midwives desc
"""

df_health_expenditure_per_capita = run_query(health_expenditure_per_capita_query, conn, "2017")
df_nurses = run_query(nurses_query, conn, "2017")

In [48]:
df_health_expenditure_per_capita

,country_name,country_code,alpha_2,health_expenditure_per_capita
0,United States of America (the),USA,US,10246.138672
1,Switzerland,CHE,CH,9956.259766
2,Norway,NOR,NO,7936.375000
3,Iceland,ISL,IS,6086.311523
4,Sweden,SWE,SE,5904.583984
...,...,...,...,...
180,Burundi,BDI,BI,23.500433
181,Gambia (the),GMB,GM,23.272326
182,South Sudan,SSD,SS,22.888573
183,Mozambique,MOZ,MZ,21.071156
184,Congo (the Democratic Republic of the),COD,CD,19.431646

In [46]:
df_nurses

         country_name country_code alpha_2  nurses_and_midwives
0              Belize          BLZ      BZ             185.3140
1             Belgium          BEL      BE              18.9734
2              Norway          NOR      NO              18.1559
3         Switzerland          CHE      CH              17.5357
4             Ireland          IRL      IE              16.0996
..                ...          ...     ...                  ...
123           Senegal          SEN      SN               0.3127
124              Chad          TCD      TD               0.2322
125  Papua New Guinea          PNG      PG               0.2253
126       Afghanistan          AFG      AF               0.1755
127         Guatemala          GTM      GT               0.0686

[128 rows x 4 columns]

# Queries Relacionadas a Educação

In [49]:
research_query = """
select
cc.country_name,
e.country_code,
cc.alpha_2,
research_and_development_expenditure
from education_{} e
inner join
country_codes as cc on cc.alpha_3 = e.country_code
where research_and_development_expenditure is not null
order by research_and_development_expenditure desc
"""

scientific_articles_query = """
select
cc.country_name,
e.country_code,
cc.alpha_2,
scientific_and_technical_journal_articles
from education_{} e
inner join
country_codes as cc on cc.alpha_3 = e.country_code
where scientific_and_technical_journal_articles is not null
order by scientific_and_technical_journal_articles desc
"""

df_research = run_query(research_query, conn, "2017")
df_scientific_articles = run_query(scientific_articles_query, conn, "2017")

In [51]:
df_research

,country_name,country_code,alpha_2,research_and_development_expenditure
0,Israel,ISR,IL,4.81602
1,Korea (the Republic of),KOR,KR,4.55324
2,Sweden,SWE,SE,3.39676
3,Switzerland,CHE,CH,3.37286
4,Japan,JPN,JP,3.21254
...,...,...,...,...
86,Iraq,IRQ,IQ,0.04455
87,Honduras,HND,HN,0.04000
88,Myanmar,MMR,MM,0.03186
89,Guatemala,GTM,GT,0.02800
90,Madagascar,MDG,MG,0.01465

In [52]:
df_scientific_articles

,country_name,country_code,alpha_2,scientific_and_technical_journal_articles
0,China,CHN,CN,473438.51
1,United States of America (the),USA,US,432216.49
2,India,IND,IN,121631.31
3,Germany,DEU,DE,107803.17
4,Japan,JPN,JP,101084.19
...,...,...,...,...
191,Andorra,AND,AD,2.01
192,Sao Tome and Principe,STP,ST,0.88
193,Marshall Islands (the),MHL,MH,0.72
194,Tuvalu,TUV,TV,0.65
195,Nauru,NRU,NR,0.00

# Queries relacionadas a Socio Economics

In [54]:
unemployment_query = """
select
cc.country_name,
se.country_code,
cc.alpha_2,
unemployment
from socioEconomics_{} se
inner join
country_codes as cc on cc.alpha_3 = se.country_code
where unemployment is not null
order by unemployment desc
"""

pib_per_capita_query = """
select
cc.country_name,
e.country_code,
cc.alpha_2,
gdp_per_capita
from economics_{} e 
inner join
country_codes as cc on cc.alpha_3 = e.country_code
where gdp_per_capita is not null
order by gdp_per_capita desc
"""

gini_query = """
select
cc.country_name,
e.country_code,
cc.alpha_2,
e.gini_index
from economics_{} e 
inner join
country_codes as cc on cc.alpha_3 = e.country_code
where gini_index is not null
order by gini_index desc
"""

df_unemployment = run_query(unemployment_query, conn, 2017)
df_pib_per_capita = run_query(pib_per_capita_query, conn, 2017)
df_gini = run_query(gini_query, conn, 2017)

OperationalError: (psycopg2.errors.AdminShutdown) terminating connection due to administrator command
SSL connection has been closed unexpectedly

[SQL:
select
cc.country_name,
se.country_code,
cc.alpha_2,
unemployment
from socioEconomics_2017 se
inner join
country_codes as cc on cc.alpha_3 = se.country_code
where unemployment is not null
order by unemployment desc
]
(Background on this error at: http://sqlalche.me/e/13/e3q8)